app/controllers/clubs_controller.rb

SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
---
  def show
    @club = Club.find(params[:id])

SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
---
  def edit
    @club = Club.find(params[:id])

INSERT INTO "clubs" ("name", "created_at", "updated_at") VALUES(NULL, '2009-11-14 22:14:56', '2009-11-14 22:14:56')
---
  def create
    @club = Club.new(params[:club])

    respond_to do |format|
      if @club.save

SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
---
  def update
    @club = Club.find(params[:id])

SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
DELETE FROM "clubs" WHERE "id" = 1
---
  def destroy
    @club = Club.find(params[:id])
    @club.destroy