app/controllers/students_controller.rb

SELECT * FROM "students"
---
	def index
		@only_active = get_default(:only_active)

		@club = Club.find(params[:club_id])
		@students = Student.find(:all, :include => [ "graduations", "payments", "club", "groups", "main_interest", "board_position", "club_position", "title" ], :conditions => { :club_id => @club.id }, :order => "fname, sname")

		if @only_active == 'yes'
			@students = @students.select { |s| s.active? }

SELECT * FROM "students" WHERE ("students"."id" = 953125641)
---
	def show
		@student = Student.find(params[:id])

SELECT * FROM "students" WHERE ("students"."id" = 953125641)
---
	def edit
		@student = Student.find(params[:id])

INSERT INTO "students" ("city", "personal_number", "created_at", "title", "comments", "zipcode", "updated_at", "club_id", "home_phone", "street", "fname", "password", "sname", "email", "mobile_phone") VALUES(NULL, NULL, '2009-11-14 22:14:56', NULL, NULL, NULL, '2009-11-14 22:14:56', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
	def create
		@student = Student.new(params[:student])
		@club = @student.club

		if params.key? :member_of
			group_ids = params[:member_of].keys
			@student.group_ids = group_ids
		end

		if params.key? :subscribes_to
			ml_ids = params[:subscribes_to].keys
			@student.mailing_list_ids = ml_ids
		end

		respond_to do |format|
			if @student.save

SELECT * FROM "students" WHERE ("students"."id" = 953125641)
---
	def update
		@student = Student.find(params[:id])

SELECT * FROM "students" WHERE ("students"."id" = 953125641)
DELETE FROM "students" WHERE "id" = 953125641
---
	def destroy
		@student = Student.find(params[:id])
		@student.destroy