app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "club_id", "fname", "login", "password", "sname", "email") VALUES('2009-11-14 22:14:56', '2009-11-14 22:14:56', NULL, NULL, NULL, NULL, NULL, NULL)
---
	def create
		@user = User.new(params[:user])
		success = @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
	def update
		@user = User.find(params[:id])